{
  "pathway_name": "basal-cell-carcinoma-clinical-pathways",
  "original_file": "basal-cell-carcinoma-clinical-pathways-v1-2024_complete_summary.json",
  "processed_at": "2025-03-29T02:04:24.081231",
  "matching_summary": "Basal cell carcinoma (BCC) patients require initial evaluation for candidacy for local therapies (surgical excision, Mohs surgery, topical treatments, radiation therapy) with systemic imaging performed as clinically indicated. No molecular testing is required for standard prognostication or therapy selection. Systemic therapy is indicated for patients deemed not candidates for definitive local medical, surgical, or radiation treatment as determined by multidisciplinary discussion. First-line systemic therapy follows assessment of prior hedgehog inhibitor exposure; patients without prior exposure are evaluated for hedgehog inhibitor therapy eligibility with Vismodegib as the preferred agent. Hedgehog inhibitor exclusion criteria include inability to tolerate oral medication, pregnancy/breastfeeding, and fertility concerns. If ineligible for hedgehog inhibitors, patients are assessed for immunotherapy with Cemiplimab. Immunotherapy exclusion criteria include active autoimmune disease, primary immune deficiency, concurrent immunosuppression (including prednisone equivalent >10mg/day), prior allogeneic hematopoietic stem cell transplantation, and prior solid organ transplant. For metastatic BCC requiring second-line treatment following progression on first-line therapy, options include: for patients with progression on previous hedgehog inhibitor, PD1/PD-L1 therapy; for patients without prior therapy, either hedgehog inhibitor therapy followed by immunotherapy assessment or a combination approach with hedgehog inhibitor therapy AND PD1/PD-L1 (requiring multidisciplinary discussion). Palliative care should be considered for patients who have progressed on available therapies. Key medications include Vismodegib (oral hedgehog pathway inhibitor) and Cemiplimab (PD-1 inhibitor immunotherapy). Multidisciplinary discussion is indicated for initial determination of local vs. systemic approach, when patients are ineligible for standard therapies, after progression on first-line therapy, when considering combination approaches, for complex cases with comorbidities affecting treatment selection, and when standard therapy options are exhausted.",
  "word_count": 259
}