{
  "pathway_name": "biliary-tract-cancer-clinical-pathways",
  "original_file": "biliary-tract-cancer-clinical-pathways-v3-2024_complete_summary.json",
  "processed_at": "2025-03-29T01:58:35.893376",
  "matching_summary": "Biliary tract cancer pathway applies to patients with cholangiocarcinoma (intrahepatic or extrahepatic) or gallbladder cancer. Diagnostic criteria include positive findings on multiphase CT or contrast MRI with MRCP, elevated tumor markers (CEA, CA 19-9, AFP), and abnormal liver function tests. Disease classification follows TNM staging with distinct management for resectable, unresectable, and metastatic disease. For resected disease, risk stratification includes margin status (R1 positive) and lymph node involvement. High-risk patients receive capecitabine (4 months) with chemoradiation or gemcitabine-based chemotherapy with chemoradiation if capecitabine contraindicated (adherence issues, inability to self-report toxicity, CrCl <30 ml/min). Standard-risk patients receive capecitabine (6 months), while T1N0 gallbladder cancers qualify for observation. Unresectable/metastatic first-line treatment includes durvalumab+gemcitabine+cisplatin for immunotherapy candidates (excluding patients with prior solid organ transplant or uncontrolled autoimmune conditions) or gemcitabine+cisplatin alone. Second-line therapy is guided by molecular alterations: pemigatinib for FGFR2 fusion/rearrangement, ivosidenib for IDH-1 mutation, fam-trastuzumab deruxtecan-nxki for HER2 IHC 3+, dabrafenib+trametinib for BRAF V600E, entrectinib for NTRK fusion, or mFOLFOX6/gemcitabine+cisplatin for no targetable alterations. DPYD testing is required before 5-fluorouracil/capecitabine administration. Molecular testing includes MMR/MSI status for all patients and comprehensive genomic profiling for unresectable/metastatic disease. Transplantation may be considered for unresectable perihilar/hilar cholangiocarcinomas ≤3cm without metastases or nodal disease. Germline testing is indicated for patients <50 years, those with personal history of other cancers, or family history of bile duct cancer.",
  "word_count": 221
}