{
  "pathway_name": "bladder-cancer-clinical-pathways-508-remediated",
  "original_file": "bladder-cancer-clinical-pathways-v1-2025-508-remediated_complete_summary.json",
  "processed_at": "2025-03-29T01:59:45.455176",
  "matching_summary": "Bladder cancer pathway eligibility requires CT urogram, cystoscopy, and TURBT for diagnosis and staging. Patients are stratified into non-muscle invasive bladder cancer (NMIBC) or muscle invasive bladder cancer (MIBC) based on TURBT pathology. NMIBC is classified as Low Risk (papillary urothelial neoplasm of low malignant potential or low-grade Ta ≤3cm solitary), Intermediate Risk (low-grade with T1/multifocal/>3cm/recurrence or high-grade Ta <3cm solitary), or High Risk (high-grade with CIS/T1/>3cm/multifocal or variant histologies/LVI/prostatic involvement). MIBC includes Stage II, IIIA, IIIB, IVA, and IVB disease. Treatment for NMIBC varies by risk: Low Risk requires surveillance; Intermediate Risk requires intravesical BCG or gemcitabine; High Risk requires BCG, radical cystectomy, or alternative therapies for BCG-unresponsive disease (gemcitabine/docetaxel, pembrolizumab, nadofaragene firadenovec). MIBC treatment depends on chemotherapy candidacy and includes neoadjuvant gemcitabine/cisplatin/durvalumab followed by radical cystectomy with adjuvant durvalumab, or bladder preservation with 5FU/mitomycin and radiotherapy. Stage IVA treatment options include enfortumab vedotin with pembrolizumab, gemcitabine/cisplatin/nivolumab, or 5FU/mitomycin with radiation. Stage IVB (metastatic) treatment includes enfortumab vedotin with pembrolizumab, carboplatin/gemcitabine with avelumab maintenance, or pembrolizumab monotherapy, with second-line options including erdafitinib for FGFR3 alterations or fam-trastuzumab deruxtecan for HER2 overexpression. Molecular testing for advanced disease includes comprehensive genomic profiling and PD-L1 expression testing. Special scenarios include prostatic urethral involvement and upper GU tract carcinoma. Presumptive service connection applies to Vietnam veterans (Agent Orange exposure), Atomic veterans (radiation exposure), and Gulf War/Post-9/11 veterans with specific deployment locations.",
  "word_count": 228
}