{
  "pathway_name": "breast-cancer-risk-reduction-clinical-pathways",
  "original_file": "breast-cancer-risk-reduction-clinical-pathways-v1-2025-508h_complete_summary.json",
  "processed_at": "2025-03-29T01:57:55.320690",
  "matching_summary": "This pathway applies to individuals aged ≥35 years with elevated breast cancer risk defined by: Gail Model ≥1.7% 5-year risk, Tyrer-Cuzick >5% 10-year risk, chest radiation exposure before age 30, ADH/ALH (Atypical Ductal/Lobular Hyperplasia), LCIS (Lobular Carcinoma in Situ), or pathogenic/likely pathogenic germline variants. High-risk patients (≥20% lifetime risk) require annual mammogram and MRI. Pharmacologic interventions vary by menopausal status: pre-menopausal women without contraindications receive tamoxifen 20mg daily for 5 years; peri-menopausal women receive tamoxifen 5mg daily for 3 years; post-menopausal women with osteoporosis/osteopenia receive raloxifene 60mg daily for 5 years if no history of DVT/PE/stroke, while those without bone density concerns receive anastrozole. Tamoxifen contraindications include DVT, PE, stroke, hypersensitivity, pregnancy, uterine malignancy, and concomitant warfarin therapy. Specific surveillance protocols exist for genetic variants: BRCA1/2 carriers require annual breast MRI starting age 25, annual mammogram plus MRI age 30-75; PALB2, PTEN, CDH1, and STK11 carriers need annual mammogram and MRI from age 30; TP53 carriers need annual MRI age 20-29, then mammogram plus MRI age 30-75; ATM carriers need annual mammogram from age 40 and consider MRI age 30-35; CHEK2 carriers need mammogram from age 40 and consider MRI age 30-35; NF1 carriers need mammogram from age 30 and MRI age 30-50; BARD1, RAD51C, and RAD51D carriers need mammogram and consider MRI from age 40. Risk-reducing mastectomy (RRM) should be discussed with BRCA1/2, PALB2, PTEN, TP53, CDH1, and STK11 carriers. Risk-reducing salpingo-oophorectomy (RRSO) should be considered for BRCA1/2 carriers as it reduces breast cancer risk by ~50% if pre-menopausal.",
  "word_count": 250
}