{
  "pathway_name": "glioblastoma-clinical-pathways",
  "original_file": "glioblastoma-clinical-pathways-v2-2024_complete_summary.json",
  "processed_at": "2025-03-29T01:56:56.772507",
  "matching_summary": "Glioblastoma pathway applies to patients with structural imaging (preferably MRI) suspicious for high-grade glioma requiring neurosurgical evaluation for maximal safe resection or stereotactic biopsy if unresectable. Post-surgical MRI within 72 hours assesses resection extent. Molecular testing stratifies patients into standard testing (age >55, non-midline tumor, non-posterior fossa location, no previous low-grade glioma) requiring IDH and ATRX immunohistochemistry, or comprehensive genomic profiling for atypical features (age <55, midline tumor, circumscribed glioma, posterior fossa location, unusual histology, IDH-wildtype with ATRX loss, or IDH-wildtype without glioblastoma-defining alterations). Diagnostic classification follows WHO criteria: IDH-mutant with ATRX loss suggests diffuse astrocytoma; IDH-mutant with retained ATRX requires 1p/19q co-deletion testing (oligodendroglioma if co-deleted); IDH-wildtype with TERT mutation, EGFR amplification, or chromosome 7 gain with chromosome 10 loss confirms glioblastoma. MGMT promoter methylation testing predicts temozolomide response. Treatment depends on Karnofsky Performance Status (KPS): patients with KPS ≥60 receive hypofractionated radiation if ≥70 years or standard radiation with concurrent temozolomide (75 mg/m² daily) if <70 years. Adjuvant temozolomide continues for 6-12 cycles with brain MRI every 2-3 months. Pseudoprogression monitoring is essential within 12 weeks post-radiation. Veterans with brain cancer/glioblastoma may qualify for automatic service connection if exposed to ionizing radiation as Atomic Veterans or served in specific regions (Afghanistan, Djibouti, Egypt, Jordan, Lebanon, Syria, Uzbekistan, Yemen, Southwest Asia theater, Somalia) after specified dates (September 11, 2001 or August 2, 1990).",
  "word_count": 224
}