{
  "pathway_name": "meningioma-clinical-pathways",
  "original_file": "meningioma-clinical-pathways-v2-2024-508h_complete_summary.json",
  "processed_at": "2025-03-29T01:57:14.242621",
  "matching_summary": "Meningioma diagnosis requires MRI with/without contrast (or CT with contrast if MRI contraindicated) showing characteristic meningioma findings. Neurological examination assesses for increased intracranial pressure symptoms. WHO classification grades meningiomas as Grade 1, 2, or 3, with treatment decisions based on this grading. Simpson Grading System (Grades 1-5) classifies extent of surgical resection, with Grades 1-3 indicating gross total resection and Grades 4-5 indicating subtotal resection. TERT promoter mutation testing is required for all patients regardless of histology. Chromosomal analysis via FISH (preferred) targets CDKN2A/B homozygous loss, or alternatively microarray analysis (Oncoscan FFPE). Treatment involves surgical resection when feasible, followed by post-resection MRI. Grade 1 with residual tumor requires radiation oncology referral; without residual tumor requires MRI surveillance. Grade 2 cases are referred to radiation oncology; those with residual tumor receive adjuvant radiotherapy, while those without residual tumor may choose between adjuvant radiotherapy or MRI surveillance. Grade 3 cases require both radiation oncology referral for radiotherapy and neuro-oncology referral for systemic therapy consideration. Patients with neurofibromatosis type 2 may require genetics referral. Presumptive service connection applies to Atomic Veterans exposed to ionizing radiation, Gulf War Veterans (served on/after August 2, 1990 in Southwest Asia theater or Somalia), and Post-9/11 Veterans (served on/after September 11, 2001 in specified locations including Afghanistan, Djibouti, Egypt, Jordan, Lebanon, Syria, Uzbekistan, Yemen). Non-surgical candidates are referred to radiation oncology and neuro-oncology. Monitoring involves regular MRI brain with/without contrast.",
  "word_count": 232
}