{
  "pathway_name": "merkel-cell-carcinoma-clinical-pathways",
  "original_file": "merkel-cell-carcinoma-clinical-pathways-v1-2024_complete_summary.json",
  "processed_at": "2025-03-29T02:04:42.871776",
  "matching_summary": "Merkel Cell Carcinoma pathway requires diagnosis confirmation through biopsy with histopathologic examination showing CK20 positivity and neuroendocrine markers. Clinical staging involves complete skin and lymph node examination plus whole body PET/CT or contrast-enhanced CT of chest, abdomen, and pelvis, with head/neck imaging for head/neck primaries and brain MRI for neurologic symptoms. Primary tumor management includes wide local excision with sentinel lymph node biopsy for clinically node-negative disease. High-risk features warranting adjuvant radiation include tumor size >1cm, immunosuppression, and lymphovascular invasion. For node-positive disease, options include completion lymphadenectomy or radiation therapy to nodal basin. Clinically detected nodal disease requires FNA or core biopsy confirmation. In-transit metastases are managed with surgical excision if resectable or radiation if unresectable. Metastatic disease assessment includes CNS evaluation, with immunotherapy contraindications being active autoimmune disease, primary immune deficiency, concurrent immunosuppression (prednisone >10mg/day), prior allogeneic stem-cell transplantation, or solid organ transplant. First-line systemic therapy is pembrolizumab. For progression or immunotherapy-ineligible patients, options include ipilimumab/nivolumab combination or chemotherapy (carboplatin/etoposide, cisplatin/etoposide, cyclophosphamide/doxorubicin/vincristine, or topotecan). Surveillance includes skin and lymph node exams every 3-6 months for 3 years, then every 3-12 months for years 3-5, with systemic imaging every 3-12 months for high-risk patients. Recurrence management follows pathways based on local, nodal, or distant presentation. Molecular testing is not currently required for treatment selection.",
  "word_count": 214
}