{
  "pathway_name": "primary-and-secondary-myelofibrosis-clinical-pathways",
  "original_file": "primary-and-secondary-myelofibrosis-clinical-pathways-v2-2024-508h_complete_summary.json",
  "processed_at": "2025-03-29T02:02:56.373621",
  "matching_summary": "Myelofibrosis diagnosis requires peripheral blood smear showing leukoerythroblastic picture, bone marrow biopsy with reticulin stain (possibly trichrome if moderate/marked fibrosis), and bone marrow aspirate with possible \"dry tap.\" Essential molecular testing includes flow cytometry (leukemia/lymphoma panel), FISH for t(9;22) BCR::ABL1, bone marrow karyotype, and NGS panel for mutations in JAK2, CALR, MPL, ASXL1, BCOR, BCORL1, CBL, CUX1, DNMT3A, ETV6, EZH2, FLT3, IDH1/2, KRAS/NRAS, PHF6, RAD21, RUNX1, SF3B1, SMC1A/3, SRSF2, STAG2, TET2, TP53, U2AF1, ZRSR2, SETBP1, ETNK1, PTPN11, and NF1. Risk stratification uses DIPSS+, GIPSS, MIPSS70+ v2.0, or MYSEC. Treatment selection depends on transplant eligibility, symptom status, and blood counts. For symptomatic patients: anemia without splenomegaly (Hgb<10g/dL) receives danazol first-line, then momelotinib if non-responsive; anemia with symptomatic splenomegaly receives momelotinib; severe thrombocytopenia (platelets<50) receives pacritinib; thrombocytopenia (platelets≥50) receives ruxolitinib. Disease progression indicators include enlarging spleen, worsening leukocytosis with blasts, new transfusion dependency, unexplained cytopenia, worsening B symptoms, or clonal evolution. For progressive disease: anemia receives momelotinib (if not previously used) or pacritinib (if momelotinib previously used); progressive splenomegaly with platelets<50K receives pacritinib (if not previously used) or momelotinib (if pacritinib previously used); progressive splenomegaly with platelets≥50K receives ruxolitinib (if not previously used) or fedratinib (if ruxolitinib previously used). AML progression requires transplant referral or AML pathway. JAK inhibitors require 3-6 months before efficacy determination and gradual taper when discontinuing.",
  "word_count": 218
}