{
  "pathway_name": "prostate-cancer-clinical-pathways",
  "original_file": "prostate-cancer-clinical-pathways-v1-2025-508h_complete_summary.json",
  "processed_at": "2025-03-29T02:00:05.553706",
  "matching_summary": "Prostate cancer pathway eligibility requires PSA testing with referral for PSA >3 or 0.75ng/ml rise over one year. Diagnosis involves DRE, urinalysis, post-void residual, and prostate mpMRI (PI-RADS scoring) followed by targeted biopsy. Risk stratification categories include Very Low (T1c, Grade group 1, PSA <10ng/ml, <3 positive cores, ≤50% cancer per core, PSA density <0.15ng/ml/g), Low (T1-T2a, Grade Group 1, PSA <10ng/ml), Favorable Intermediate (T2b-T2c or Grade Group 2 or PSA 10-20ng/ml, <50% positive cores), Unfavorable Intermediate (multiple risk factors, Grade Group 3, ≥50% positive cores), High (T3a or Grade Group 4-5 or PSA >20ng/ml), Very High (T3b-T4 or primary Gleason pattern 5), Regional (N1, M0), and Metastatic (M1). Treatment pathways vary by risk group and life expectancy, including active surveillance, observation, radiation therapy, radical prostatectomy, and ADT. Advanced disease management includes CSPC M1 (categorized as low-volume: no visceral mets AND ≤4 bone mets, or high-volume: visceral mets OR >4 bone mets) and CRPC (M0 with PSA doubling time assessment, M1 with multiple treatment lines). Molecular testing includes germline testing (BRCA1/2, ATM, CHEK2, EPCAM, HOXB13, MLH1, MSH2, MSH6, PMS2, NBN, TP53) and somatic testing for HRR genes, MSI/dMMR, and TMB. Treatment options include abiraterone, docetaxel, cabazitaxel, Lu177-PSMA, olaparib (for HRRm), pembrolizumab (for MSI-H/dMMR/TMB high), radium 223 (for bone mets), and platinum-based therapy for neuroendocrine components. Biochemical recurrence is defined as PSA >0.2 post-prostatectomy or PSA >2 above nadir post-radiation. Agent Orange exposure qualifies Vietnam veterans for presumptive disability benefits, while Gulf War and Post-9/11 veterans in specific locations qualify for reproductive cancer presumptions.",
  "word_count": 253
}