{
  "pathway_name": "soft-tissue-sarcoma-clinical-pathways",
  "original_file": "soft-tissue-sarcoma-clinical-pathways-v1-2024-508h_complete_summary.json",
  "processed_at": "2025-03-29T02:04:16.096408",
  "matching_summary": "Soft Tissue Sarcoma pathway applies to patients with mesenchymal tissue malignancies including specific subtypes: Kaposi sarcoma, angiosarcoma, phyllodes tumors, intra-abdominal/retroperitoneal sarcoma, extremity/body wall/head/neck sarcoma, desmoid tumors, rhabdomyosarcoma, and uterine sarcoma. Diagnostic criteria require core needle biopsy with expert pathology review, MRI for extremity locations, CT for thoracic/abdominal sites, and CT chest with contrast for metastasis evaluation. Molecular testing includes somatic NGS and DNA/RNA-based Comprehensive Genomic Profiling via Tempus or Foundation Medicine platforms. Staging follows standard sarcoma classification with treatment differentiated by stage I-IV disease. Biomarkers include cardiac function (EF >55%), TMB ≥10, MSI-H status, and specific genetic alterations (BRCA, NTRK, ALK). Treatment options vary by subtype: Kaposi sarcoma uses liposomal doxorubicin, paclitaxel, or pomalidomide; angiosarcoma employs paclitaxel, liposomal doxorubicin, gemcitabine/docetaxel, or pembrolizumab; phyllodes tumors require excision with margin assessment; intra-abdominal/retroperitoneal sarcomas use doxorubicin ± ifosfamide, trabectedin, or gemcitabine/docetaxel; extremity sarcomas follow doxorubicin ± ifosfamide and gemcitabine/docetaxel sequence; desmoid tumors may receive sulindac, celecoxib, sorafenib, or ifosfamide; rhabdomyosarcoma uses VAC/IE regimen (vincristine, dactinomycin, cyclophosphamide, ifosfamide, etoposide); uterine sarcomas employ histology-specific approaches including doxorubicin/trabectedin, gemcitabine/docetaxel, aromatase inhibitors, or sirolimus. Cardiac monitoring requires echocardiogram every 3 months during anthracycline therapy. Service connection applies to Vietnam Veterans, Atomic Veterans, and specific Gulf War/Post-9/11 Veterans.",
  "word_count": 200
}