{
  "pathway_name": "uterine-cancer-clinical-pathways-508",
  "original_file": "uterine-cancer-clinical-pathways-v1-2024-508_complete_summary.json",
  "processed_at": "2025-03-29T02:00:15.339141",
  "matching_summary": "This pathway applies to patients with endometrial cancer or endometrial intraepithelial neoplasia (EIN) confirmed by endometrial biopsy. Initial workup includes CT chest/abdomen/pelvis for high-risk histology (grade 2-3 endometrioid, carcinosarcoma, clear cell, serous, mixed or undifferentiated carcinoma) or prolonged abnormal bleeding. Standard treatment involves total hysterectomy, bilateral salpingo-oophorectomy (BSO), and lymph node staging. Stage I endometrioid management follows GOG-99 risk stratification based on grade, lymphovascular space invasion (LVSI), and myometrial invasion depth. High-intermediate risk patients receive vaginal brachytherapy. Stage II endometrioid treatment depends on p53 status: if abnormal, paclitaxel/carboplatin plus radiation; if normal, radiation only. Non-endometrioid cancers require molecular testing for HER2, MMR/MSI, and p53 status. Stage III-IV treatments include paclitaxel/carboplatin with targeted therapy based on biomarkers: trastuzumab for HER2+, pembrolizumab for dMMR/MSI-H, or dostarlimab for carcinosarcoma. Fertility-sparing management is available for grade 1 endometrioid/EIN without myometrial invasion using continuous progesterone therapy (preferably levonorgestrel IUD). Medically inoperable patients with limited disease receive hormone therapy for low-grade endometrioid without invasion, or radiation for higher grades or with invasion. Recurrent disease requires biopsy confirmation, molecular testing, and treatment based on prior therapy. Surveillance protocols vary by risk level, with higher-risk patients (Stage III with gross nodal disease or Stage IV) requiring more intensive monitoring. Germline testing is indicated for dMMR/MSI-H tumors or patients under 50. Immunotherapy eligibility excludes patients with active autoimmune disease, primary immune deficiency, concurrent immunosuppression, or prior transplantation.",
  "word_count": 228
}