{
  "pathway_name": "acute-myeloid-leukemia-clinical-pathways-v2-2024",
  "processed_at": "2025-03-28T18:01:11.407985",
  "responses": [
    {
      "page": 2,
      "image_file": "pg2.png",
      "response": "# Analysis of Clinical Pathway Table of Contents\n\nThank you for sharing this image. I can see you've provided a table of contents from what appears to be a clinical pathway document, but not the actual clinical pathway content itself. The table of contents shows:\n\n1. **Presumptive Conditions** (page 3)\n2. **First Line** (page 4)\n3. **Relapsed** (page 5)\n4. **Molecular Testing Table** (page 6)\n\nFrom this structure, I can infer this is likely a clinical pathway for a condition that requires:\n- Initial diagnosis/presumptive assessment\n- First-line treatment protocols\n- Management of relapsed cases\n- Molecular/genetic testing to guide treatment decisions\n\nHowever, to create a detailed clinical pathway flowchart as requested, I would need to see the actual content on pages 3-6. This would allow me to identify the specific decision points, treatment options, assessment criteria, and logical flows between different clinical scenarios.\n\nWould you be able to share the actual content pages of this clinical pathway document so I can develop a comprehensive flowchart based on the specific protocols outlined in the document?",
      "thinking": "The user has shared an image that shows a table of contents from what appears to be a clinical pathway document. The table of contents includes:\n\n1. Presumptive Conditions (page 3)\n2. First Line (page 4)\n3. Relapsed (page 5)\n4. Molecular Testing Table (page 6)\n\nNow, the user is asking me to convert a clinical pathway document into a structured flowchart following specific steps. However, the image provided is only the table of contents, not the actual clinical pathway content that I would need to convert into a flowchart.\n\nI don't have access to the actual content of the clinical pathway (the details on pages 3-6), so I cannot create the specific flowchart for this document. I should explain this limitation to the user and ask if they can provide the actual clinical pathway content pages so I can help create the flowchart they're looking for."
    },
    {
      "page": 3,
      "image_file": "pg3.png",
      "response": "The image you've shared is not a clinical pathway document, but rather an informational page about VA disability benefits for Acute Myeloid Leukemia (AML). Instead of a treatment pathway, this document outlines presumptive service connection information for veterans.\n\n## Document Content Summary:\n\n**Title: Acute Myeloid Leukemia – Presumptive Conditions**\n\n**Main Information:**\n- The VA automatically presumes certain disabilities were caused by military service based on specific circumstances of a veteran's service\n- Veterans diagnosed with presumptive conditions within certain groups can qualify for disability compensation\n\n**Specific Presumptive Group:**\n- Atomic Veterans – Exposure to Ionizing Radiation\n  • All forms of leukemia (including Acute Myeloid Leukemia)\n\n**Additional Resources:**\n- For more information: U.S. Department of Veterans Affairs - Presumptive Disability Benefits (va.gov)\n\nThis document doesn't contain clinical treatment pathways, decision points, or medical algorithms for AML treatment. It's focused on VA benefits eligibility rather than medical management of the condition. If you need information about clinical pathways for AML treatment, I would need a different document that outlines diagnostic and treatment protocols.",
      "thinking": "The image provided shows information about Acute Myeloid Leukemia (AML) as a presumptive condition for Veterans Affairs (VA) disability benefits. Let me analyze what's shown in the image:\n\nTitle: \"Acute Myeloid Leukemia – Presumptive Conditions\"\n\nContent:\n1. The VA automatically presumes that certain disabilities were caused by military service due to the unique circumstances of a specific Veteran's military service.\n2. If a presumed condition is diagnosed in a Veteran within a certain group, they can be awarded disability compensation.\n3. Under \"Atomic Veterans – Exposure to Ionizing Radiation\":\n   - All forms of leukemia (including AML by implication) are listed\n4. Reference to the U.S. Department of Veterans Affairs - Presumptive Disability Benefits website for more information\n\nThis is not actually a clinical pathway document as requested in the prompt. Instead, it's an informational document about VA disability benefits related to AML for veterans. The document specifically notes that AML (as a form of leukemia) is presumed to be service-connected for veterans who were exposed to ionizing radiation during their military service (\"Atomic Veterans\").\n\nGiven that this isn't a clinical pathway document with treatment algorithms, decision points, etc., I cannot create the requested flowchart based on this image. I should explain this to the user and provide information about what I can see in the document instead."
    },
    {
      "page": 4,
      "image_file": "pg4.png",
      "response": "# Clinical Pathway: Acute Myeloid Leukemia (AML) - First Line Treatment\n\n## Initial Stratification\nThe clinical pathway begins with a fundamental decision point:\n- **Candidate for intensive therapy?** This assessment determines the primary treatment pathway\n\n## For Intensive Therapy Candidates\nIf YES to intensive therapy, patients are assessed for acute molecular risk group, leading to multiple treatment pathways:\n\n### FLT3 Status Assessment\n1. **FLT3 Mutant Pathway**:\n   - Induction: Cytarabine, daunorubicin/idarubicin, midostaurin\n   - Bone marrow biopsy to assess response\n   - If response reached:\n     * Consolidation options include cytarabine with midostaurin or transplant\n\n2. **FLT3 Wild-type** branches into multiple pathways:\n   \n   a. **Favorable Cytogenetics** pathway:\n      - Induction: Cytarabine, daunorubicin/idarubicin\n      - Response assessment\n      - If response reached:\n        * Options include: HiDAC, FLAG-IDA, or cytarabine-based regimens\n   \n   b. **Intermediate Cytogenetics** pathway (multiple iterations):\n      - Induction: Cytarabine with daunorubicin/idarubicin\n      - Response assessment\n      - If response reached:\n        * Various consolidation options including HIDAC, FLAG-IDA, transplant, or alternative therapies\n   \n   c. **Negative/Poor** risk group:\n      - Induction: Cytarabine with daunorubicin/idarubicin\n      - Response assessment\n      - Consolidation based on response status\n   \n   d. **Therapy-related (t-AML)/MDS-AML/adverse risk/complex cytogenetics**:\n      - Specialized treatment protocols with potential liposomal formulations\n      - Response assessment\n      - Consolidation regimens tailored to this high-risk group\n\n### Other Groups\n- Specific treatment algorithms for other molecular/cytogenetic subgroups\n- Decision tree based on response assessment\n- Advanced age-specific considerations\n\n## For Non-Intensive Therapy Candidates\nIf NO to intensive therapy:\n- Alternative therapy options including:\n  * Decitabine and venetoclax\n  * Low-intensity regimens\n  * Clinical trial consideration\n  * Supportive care options\n\n## Supplemental Clinical Information\n- **Risk Stratification**: Based on cytogenetics and molecular markers (including NPM1, FLT3, CEBPA, IDH1/2, TP53, RUNX1, ASXL1, and others)\n- **Supportive Care**: Includes prophylaxis for patients who are transplant candidates\n- **Monitoring**: Bone marrow biopsy monitoring schedules (typically 14 days for induction and 21-28 days for consolidation)\n- **Diagnostic Testing**: Required molecular and genetic testing prior to therapy initiation\n- **Intensive Therapy Criteria**: Based on age, performance status, comorbidities, and social factors\n- **Bone Marrow Biopsy**: After induction and consolidation, variability in response times\n\nThe pathway emphasizes individualized treatment based on molecular features, with treatment intensification for higher-risk disease and response-adapted therapy throughout the treatment course.",
      "thinking": "This image shows a clinical pathway flowchart for Acute Myeloid Leukemia (AML) - First Line treatment. I'll analyze this systematically to provide a structured text description.\n\nThe flowchart illustrates the decision-making process and treatment algorithms for first-line management of AML. Let me break down the key components:\n\nStarting point:\n- \"Acute Myeloid Leukemia First Line\"\n\nInitial Assessment:\n- The pathway begins with an assessment of whether the patient is a \"Candidate for intensive therapy?\"\n\nMajor Branches:\n1. If YES to intensive therapy:\n   - This leads to assessment of \"Acute molecular risk group\"\n   - Further branching based on FLT3 status\n   - Additional molecular categorizations\n   - Multiple treatment pathways based on molecular features\n\n2. If NO to intensive therapy:\n   - Leads to alternative treatment approaches for non-intensive therapy candidates\n   - These appear to be separate treatment algorithms for less fit patients\n\nTreatment Pathways:\n- For intensive therapy candidates, there are several distinct treatment algorithms based on molecular features:\n  - FLT3 mutant vs. FLT3 wild-type\n  - Various cytogenetic/molecular risk groups\n  - Each pathway leads to specific induction and consolidation regimens\n\nResponse Assessment:\n- There are multiple decision points assessing \"Response Reached?\" which determine subsequent treatment steps\n\nConsolidation Therapy:\n- After successful response, various consolidation regimens are indicated\n- These appear to include chemotherapy and possibly transplantation options\n\nThe bottom portion of the image contains textual notes with important clinical guidance, which include:\n\n1. Risk stratification criteria for AML using cytogenetic and molecular markers\n2. Supporting care recommendations\n3. Monitoring requirements\n4. Criteria for intensive therapy\n5. Details about specific regimens\n6. Notes about bone marrow biopsy, molecular testing, and other clinical considerations\n\nNow I'll organize this into a comprehensive, structured description of the clinical pathway."
    },
    {
      "page": 5,
      "image_file": "pg5.png",
      "response": "# Clinical Pathway: Relapsed Acute Myeloid Leukemia (AML)\n\n## Initial Assessment & Stratification\n1. **Diagnosis Confirmation at Relapse**\n   - Required testing: Flow cytometry (including CD33 expression)\n   - Myeloid NGS testing (minimum panels must include: ASXL1, BCOR, CEBPA, EZH2, FLT3, IDH1, IDH2, NPM1, RUNX1, SF3B1, SRSF2, STAG2, TET2, U2AF, ZRSR2)\n   - Note: Relapse defined as >6 months prior to therapy\n\n2. **Prior Treatment History Assessment**\n   - Prior transplant? (Yes/No)\n   - Prior therapy with HMA and venetoclax? (Yes/No)\n\n## Treatment Pathway\n\n### BRANCH 1: Patients with Prior Transplant\n1. Discuss with cell therapy team for reinduction/consolidation\n2. If eligible → Refer to cell therapy team\n3. Treatment: Decitabine and venetoclax\n4. Subsequent step: Refer to allogeneic transplant\n\n### BRANCH 2: Patients without Prior Transplant\n1. **Assess transplant candidacy**\n   - If transplant candidate → Decitabine and venetoclax → Proceed to allogeneic transplant\n   - If not transplant candidate → Determine disease subtype based on molecular/genetic testing\n\n### Molecular/Genetic-Based Treatment Decisions\nBased on subtype, the pathway branches into specific treatment options:\n\n1. **IDH1 Mutation Positive**\n   - Shared decision-making with patient preferences considered\n   - Option A: Decitabine and venetoclax\n   - Option B: Ivosidenib\n\n2. **IDH2 Mutation Positive**\n   - Shared decision-making with patient preferences considered\n   - Option A: Decitabine and venetoclax\n   - Option B: Enasidenib\n\n3. **CD33 Expression Positive** (in absence of other targets)\n   - Shared decision-making with patient preferences considered\n   - Option A: Decitabine and venetoclax\n   - Option B: Gemtuzumab\n\n4. **FLT3 Mutation Positive**\n   - Treatment: Gilteritinib\n\n5. **All Other Subtypes**\n   - If prior HMA and venetoclax → Low-dose cytarabine + venetoclax\n   - If no prior HMA and venetoclax → Decitabine and venetoclax\n\n## Supportive Care Requirements\n- Transfusions: Platelets for counts ≤10,000/mcL; Hemoglobin ≥7 g/dL\n- Cryoprecipitate for fibrinogen <150mg/dL\n- Tumor lysis syndrome monitoring\n- Allopurinol and IV fluid prophylaxis\n- Rasburicase for patients with high WBC, hyperuricemia, and/or renal dysfunction\n- Infection prophylaxis (fungal, HSV/VZV, bacterial)\n\n## Special Considerations\n\n1. **Venetoclax Therapy Management**\n   - Drug-drug interaction monitoring (oncology pharmacist consultation recommended)\n   - Anti-infection prophylaxis for neutropenic patients\n   - Dose modifications based on blood cell counts\n   - Regular bone marrow biopsies for response assessment\n\n2. **IDH Inhibitors & Gilteritinib Monitoring**\n   - Special monitoring for differentiation syndrome\n   - Treatment protocols for differentiation syndrome\n\n3. **Clinical Trial Eligibility**\n   - Clinical trials always considered on pathway\n   - Contact CancerClinicalTrialsNavigation@va.gov for assistance\n\n4. **Cell Therapy/Transplant Considerations**\n   - Pre-transplant evaluation required\n   - Review through TRACER program\n\n[SUPPLEMENTAL DETAILS]\n- Decitabine and venetoclax is a backbone therapy appearing in multiple pathways\n- Patient preferences are explicitly incorporated into decision-making for certain molecular subtypes\n- Careful monitoring is required for all targeted therapies, with specific attention to differentiation syndrome with IDH inhibitors and gilteritinib\n- The pathway emphasizes the importance of supportive care throughout treatment",
      "thinking": "I'll analyze the clinical pathway document for relapsed Acute Myeloid Leukemia (AML) and convert it into a structured textual description.\n\nThe image shows a clinical pathway flowchart for patients with relapsed Acute Myeloid Leukemia (AML). Let me break down the key elements:\n\nTitle: Acute Myeloid Leukemia – Relapsed\n\nStarting Point: The pathway begins with \"Acute Myeloid Leukemia, Relapsed\"\n\nFirst Decision Point: Prior transplant?\n- Yes branch: Discuss with cell therapy team for reinduction/consolidation\n  - Next decision: Refer to cell therapy team -> Decitabine and venetoclax (with footnote marker 4)\n  - Then: Refer to allogeneic transplant\n- No branch: Transplant candidate?\n  - Yes branch: Decitabine and venetoclax (with footnote marker 4)\n  - No branch: Subtype?\n\nMolecular/Genetic Subtyping Branch Points:\n1. IDH1 mutation -> Patient preference after shared decision making?\n   - Option 1: Decitabine and venetoclax (with footnote marker 4)\n   - Option 2: Ivosidenib (with footnote marker †)\n\n2. IDH2 mutation -> Patient preference after shared decision making?\n   - Option 1: Decitabine and venetoclax (with footnote marker 4)\n   - Option 2: Enasidenib (with footnote marker †)\n\n3. CD33 expression -> Patient preference after shared decision making?\n   - Option 1: Decitabine and venetoclax (with footnote marker 4)\n   - Option 2: Gemtuzumab\n\n4. FLT3 mutation -> Gilteritinib (with footnote marker †)\n\n5. All others -> Prior therapy HMA and venetoclax?\n   - Yes branch: Low-dose cytarabine + venetoclax\n   - No branch: Decitabine and venetoclax (with footnote marker 4)\n\nImportant Footnotes in the Document:\n1. Clinical trial(s) always considered on pathway. For assistance finding a clinical trial, email CancerClinicalTrialsNavigation@va.gov.\n2. Diagnosis at Relapse: relapse >6 months prior to therapy; must include flow cytometry (including CD33 expression) and myeloid NGS test (at minimum must include: ASXL1, BCOR, CEBPA, EZH2, FLT3, IDH1, IDH2, NPM1, RUNX1, SF3B1, SRSF2, STAG2, TET2, U2AF, and ZRSR2).\n3. Supportive Care: Includes transfusions; platelet units ≤ 10,000/mcL; Hgb ≥ 7 g/dL; cryoprecipitate for fibrinogen < 150mg/dL; tumor lysis syndrome monitoring; allopurinol and IV fluid prophylaxis, and rasburicase treatment if needed for patients with high WBC, hyperuricemia, and/or renal dysfunction; infection prophylaxis is recommended e.g., fungal, HSV/VZV, and bacterial.\n4. Refer to Cell Therapy Team: requires pre-transplant evaluation and review through TRACER.\n5. Venetoclax has many drug-drug interactions; consultation with oncology pharmacist is recommended; anti-infection prophylaxis recommended particularly when the patient has neutropenia, e.g., fungal, HSV/VZV, and bacterial; dose modifications (duration, dose, frequency) of venetoclax are frequently needed based on blood cell counts; regular bone marrow biopsies to assess and follow response are needed with this continuous therapy.\n6. CD33 Expression: in absence of other targets.\n7. Ivosidenib, Enasidenib, and Gilteritinib: require special monitoring for and treatment of differentiation syndrome.\n\nAbbreviations:\n- AML: Acute Myeloid Leukemia\n- HMA: Hypomethylating Agent\n\nNow I'll convert this into a structured textual description following the requested format:"
    },
    {
      "page": 6,
      "image_file": "pg6.png",
      "response": "# Acute Myeloid Leukemia (AML) Molecular Testing Pathway\n\nBased on the provided table, here is a structured description of the molecular testing pathway for Acute Myeloid Leukemia:\n\n## Initial Diagnostic Testing\n\nThe following tests should be performed for all patients diagnosed with Acute Myeloid Leukemia:\n\n1. **Flow Cytometry**\n   - Test: Leukemia/lymphoma panel\n   - Specimen: Bone Marrow Biopsy or Blood\n   - Vendor: Local VA or locally contracted vendor\n   - NPOP Coverage: No\n\n2. **FISH (Fluorescence In Situ Hybridization)**\n   - Test: t(8;21), inv(16), t(15;17), and other specific translocations:\n     - t(8;21) RUNX1:RUNX1T1\n     - inv(16)/t(16;16) PML::RARA\n     - CBFB:MYH11\n     - BCR-ABL1\n     - TP53\n   - Specimen: Bone Marrow Biopsy or Blood\n   - Vendor: Local VA or locally contracted vendor\n   - NPOP Coverage: No\n\n3. **Karyotyping**\n   - Test: Standard karyotype analysis\n   - Specimen: Bone Marrow Biopsy or Blood\n   - Vendor: Local VA or locally contracted vendor\n   - NPOP Coverage: No\n\n4. **Rapid Molecular Tests** (results required within 1 week)\n   - Test: FLT3 ITD and TKD, DH1/2, NPM1 (quantitative preferred), CEBPA (optional)\n   - Specimen: Bone Marrow Biopsy or Blood\n   - Vendor: Local VA or locally contracted vendor\n   - NPOP Coverage: No\n\n## Advanced Genomic Profiling\n\n5. **Somatic NGS (Next Generation Sequencing)** - Option 1\n   - Test: NGS panel including:\n     - ASXL1, BCOR, CEBPA, EZH2, FLT3, IDH1, IDH2, NPM1, RUNX1, SF3B1\n     - SRSF2, STAG2, TP53, U2AF1, ZRSR2\n     - Optional genes include CBL, DNMT3A, KIT, KRAS, NRAS, and other genes associated with myeloid neoplasms\n   - Specimen: Bone Marrow Biopsy or Blood\n   - Vendor: GLA (Genomic Laboratory Advancement)\n   - NPOP Coverage: GLA Grant*\n\n6. **Somatic NGS** - Option 2\n   - Test: Consider Comprehensive Genomic Profiling (CGP) if no driver mutation detected\n   - Specimen: Bone Marrow Biopsy or Blood\n   - Vendor: Foundation Medicine\n   - NPOP Coverage: Yes\n\n7. **Germline NGS**\n   - Test: Consider germline testing and genetic counseling if VAF >40% in AML predisposition genes (CEBPA, DDX41, RUNX1, ANKRD26, ETV6, GATA2, SAMD9, SAMD9L, BLM, NF1, CBL)\n   - Specimen: Blood only\n   - Vendor: Local VA or locally contracted vendor\n   - NPOP Coverage: No\n\n## Special Considerations\n\n- Reach out to GLA for information on use of NGS testing under a VA sponsored grant, with no cost to your local facility\n- Rapid molecular testing results should be available within one week of testing\n- Comprehensive genomic profiling should be considered when initial testing fails to identify known driver mutations\n- Germline testing should include genetic counseling when predisposition genes show variant allele frequency >40%\n\nThis testing pathway ensures comprehensive molecular characterization of AML cases, which informs prognosis, treatment selection, and potentially identifies inherited cancer predisposition syndromes.",
      "thinking": "This image shows a detailed table about molecular testing for Acute Myeloid Leukemia (AML). Let me analyze the content and structure:\n\n**Title:**\nAcute Myeloid Leukemia – Molecular Testing Table\n\n**Main Structure:**\nThis is a table with the following columns:\n- Eligibility\n- Test Category\n- Test Type\n- Recommended Vendors\n- NPOP Coverage\n- Specimen Type\n\n**Content Details:**\nThe table specifically focuses on testing protocols for Acute Myeloid Leukemia (AML) patients, outlining:\n\n1. **Eligibility**: The table lists \"Acute Myeloid Leukemia (AML)\" as the eligibility criterion\n\n2. **Test Categories**:\n   - Flow cytometry\n   - FISH\n   - Karyotyping\n   - Rapid Molecular Tests (<1 week TAT)\n   - Somatic NGS (appears twice with different specifications)\n   - Germline NGS\n\n3. **Test Types**:\n   - Leukemia/lymphoma panel\n   - Specific genetic markers like t(8;21) RUNX1:RUNX1T1, inv(16) PML::RARA, etc.\n   - Karyotype\n   - FLT3 ITD and TKD, DH1/2, NPM1 testing\n   - More comprehensive NGS panels including genes like ASXL1, BCOR, CEBPA, etc.\n   - CGP (Comprehensive Genomic Profiling) for cases without detected driver mutations\n   - Germline testing for predisposition genes\n\n4. **Recommended Vendors**:\n   - Local VA or locally contracted vendor for most tests\n   - GLA for one of the somatic NGS options\n   - Foundation Medicine for another somatic NGS option\n\n5. **NPOP Coverage**:\n   - Mostly \"No\"\n   - \"GLA Grant\" for one test\n   - \"Yes\" for one test\n\n6. **Specimen Type**:\n   - Bone Marrow Biopsy, Blood for most tests\n   - Just Blood for germline NGS\n\nThere's also a note at the bottom stating: \"* Reach out to GLA for information on use of NGS testing under a VA sponsored grant, with no cost to your local facility\"\n\nThis table outlines a systematic approach to molecular testing for AML, including the types of tests to be performed, which vendors to use, whether they're covered by NPOP, and what specimens are required.\n\nBased on this information, I'll now convert this molecular testing table for AML into a structured clinical pathway description as requested."
    },
    {
      "page": "summary",
      "response": "# Comprehensive Summary of Acute Myeloid Leukemia (AML) Clinical Pathway\n\nThis clinical pathway provides a structured approach to AML management, beginning with molecular diagnostic testing essential for risk stratification. Initial workup includes flow cytometry, FISH for key translocations (t(8;21), inv(16), t(15;17)), karyotyping, and comprehensive NGS myeloid panel testing for mutations in critical genes including FLT3, IDH1/2, and NPM1. The pathway first stratifies patients based on eligibility for intensive therapy. For intensive therapy candidates, treatment is guided by molecular risk factors: FLT3-mutated patients receive cytarabine, daunorubicin/idarubicin plus midostaurin, while FLT3 wild-type patients are further stratified by cytogenetic risk (favorable, intermediate, unfavorable). Non-intensive therapy candidates receive either venetoclax combinations or supportive care based on performance status. Post-induction, response is assessed by bone marrow biopsy to guide consolidation decisions, which may include additional chemotherapy cycles or allogeneic transplant. For relapsed disease, the pathway recommends confirmation testing including flow cytometry and myeloid NGS, then branches based on prior transplant history and HMA/venetoclax exposure. Relapse management includes decitabine/venetoclax combinations with referral to allogeneic transplant when appropriate. The pathway also notes the presumptive service connection for veterans with AML and radiation exposure, potentially qualifying them for disability benefits.",
      "thinking": "Let me synthesize the information from the multiple pages of the clinical pathway document for Acute Myeloid Leukemia (AML) into a comprehensive summary. I'll focus on creating a logical flow that captures the essential elements while maintaining clinical accuracy.\n\nFrom the analyses, I have:\n\nPage 2: Table of contents showing the document covers Presumptive Conditions, First Line treatment, Relapsed disease management, and Molecular Testing.\n\nPage 3: Information about VA disability benefits for AML as a presumptive condition for Atomic Veterans with exposure to ionizing radiation.\n\nPage 4: First-line treatment strategies, stratifying patients based on eligibility for intensive therapy, and further branching based on molecular risk factors (particularly FLT3 status) and cytogenetics.\n\nPage 5: Management of relapsed AML, including required testing, stratification based on prior treatment (transplant, HMA/venetoclax), and subsequent treatment options.\n\nPage 6: Molecular testing requirements for AML, including flow cytometry, FISH, karyotyping, and NGS myeloid panel testing.\n\nNow I'll integrate this information into a comprehensive 200-250 word summary that follows the clinical decision-making process:\n\nThe clinical pathway begins with diagnosis and molecular characterization, then stratifies by treatment eligibility, then provides specific treatment approaches based on molecular profile, then addresses relapse scenarios. I should maintain the logical progression from diagnosis → risk assessment → first-line treatment → relapse management."
    }
  ]
}